{
  "html": "<p>Things go wrong in production applications that will never happen in local development. When you push anything live for the first time, there is always some crazy weirdness that manifests itself in dark and mysterious ways.<p>I launched the <a href=https://frontendrescue.com/>sales website</a> that you are currently looking at with some recent shiny <a href=https://frontendrescue.com/posts>blog posts</a>, ready for the world to enjoy. The world was in a good place, and I was prepared for all that came my way.<p>That is until I clicked on one of the links that I had posted on Linkedin, and instead of viewing a beautifully crafted HTML-rendered page, I looked in horror as the browser rendered a blob of JSON in all its non-HTML drabness:<p><img alt=\"loader json\"src=https://res.cloudinary.com/ddospxsc8/image/upload/v1692892010/loader-json_xjgnwt.png><p>Looking at this JSON in the browser was like a sucker punch to the solar plexus. My sales website is about building my authority as a frontend expert. This JSON blob in the browser contradicts this highly. My anxious mind was conjuring up images of prospective clients looking disgusted at this glaring bug.<p><a href=https://remix.run/docs/en/main>remix-run</a> is the framework I use for this website, and upon closer inspection, it turned out that this rogue JSON was from a <a href=https://remix.run/docs/en/1.19.3/route/loader>remix-run loader function</a> that can provide data to the current route being rendered. I was mystified as to how this could happen.<h2>Remix's routes, loader function and the undocumented _data query parameter</h2><p><a href=https://remix.run/docs/en/1.19.3/file-conventions/route-files-v2>remix-run's routes</a> will return HTML for a route from the default export of the code file that defines the route that was returning JSON. What gives?<p>I followed <a href=https://remix.run/docs/en/1.19.3/file-conventions/route-files-v2>remix-run's v2 naming convention</a> to the letter, and the <code>posts._index.tsx</code> file is the route that lists all the blog posts for the <code>/posts</code> route.<p><img alt=\"route code files\"src=https://res.cloudinary.com/ddospxsc8/image/upload/v1692450524/routes_r4hmfb.png><p>If a <a href=https://remix.run/docs/en/1.19.3/file-conventions/route-files-v2>remix-run</a> route has a function that is both a default export and a react component, then that component will render the HTML for that route.<p>Each route can also define a <a href=https://remix.run/docs/en/1.19.3/route/loader>loader function</a> that provides data to the component rendering the HTML for the current route.<p>My <code>posts._index.tsx</code> file that defines the default export for the component that renders the HTML and the loader function is below:<div class=remark-code-title>posts._index.tsx</div><pre class=language-ts><code class=\"language-ts code-highlight\"><span class=\"code-line line-number highlight-line\"line=1><span class=\"token keyword\">export</span> <span class=\"token keyword\">const</span> loader<span class=\"token operator\">:</span> <span class=\"token function function-variable\">LoaderFunction</span> <span class=\"token operator\">=</span> <span class=\"token keyword\">async</span> <span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token operator\">=></span> <span class=\"token punctuation\">{</span>\n</span><span class=\"code-line line-number\"line=2>  <span class=\"token keyword\">return</span> <span class=\"token function\">getPosts</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n</span><span class=\"code-line line-number\"line=3><span class=\"token punctuation\">}</span><span class=\"token punctuation\">;</span>\n</span><span class=\"code-line line-number\"line=4>\n</span><span class=\"code-line line-number highlight-line\"line=5><span class=\"token keyword\">export</span> <span class=\"token keyword\">default</span> <span class=\"token keyword\">function</span> <span class=\"token function\">PostsHome</span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span> <span class=\"token punctuation\">{</span>\n</span><span class=\"code-line line-number\"line=6>  <span class=\"token keyword\">const</span> posts <span class=\"token operator\">=</span> <span class=\"token generic-function\"><span class=\"token function\">useLoaderData</span><span class=\"token class-name generic\"><span class=\"token operator\">&lt;</span>PostData<span class=\"token punctuation\">[</span><span class=\"token punctuation\">]</span><span class=\"token operator\">></span></span></span><span class=\"token punctuation\">(</span><span class=\"token punctuation\">)</span><span class=\"token punctuation\">;</span>\n</span><span class=\"code-line line-number\"line=7>\n</span><span class=\"code-line line-number\"line=8>  <span class=\"token keyword\">return</span> <span class=\"token operator\">&lt;</span>Posts posts<span class=\"token operator\">=</span><span class=\"token punctuation\">{</span>posts<span class=\"token punctuation\">}</span> <span class=\"token operator\">/</span><span class=\"token operator\">></span><span class=\"token punctuation\">;</span>\n</span><span class=\"code-line line-number\"line=9><span class=\"token punctuation\">}</span>\n</span></code></pre><p>But why was my default export not being called, and why was I getting the <code>loader</code> function's JSON instead?<p>Remix has an undocumented feature which Remix uses internally to get data from the loader file if the request has a <code>?_data</code> querystring on the URL.<p>When you click a link in a remix app, the HTML for the new route is rendered on the client side in the browser. Remix only needs to get the data from the loader function to render the page and NOT the whole server-rendered HTML. Remix will return the loader function's data if you include a query string parameter of <code>_data</code>, e.g. <code>_data=routes%2Fposts._index</code>.<p>Conversely, if you access a route directly, e.g. <a href=https://frontendrescue.com/posts>https://frontendrescue.com/posts</a>, the whole rendering process will happen on the server, and the HTML will be generated on the server. No call to the same route with the now infamous <code>_data</code> query parameter key will happen.<p>You can see this by observing the network tab if you click on a link that causes a client-side render of a new route.<p><img alt=\"network tab\"src=https://res.cloudinary.com/ddospxsc8/image/upload/v1692540964/_data_erbuze.png><p>I found all this out later, but I was still in distress trying to find out where this evil-looking JSON was coming from.<h2>Remix, AWS architect and Cloundfront cache keys</h2><p>Remix comes with several <a href=https://remix.run/docs/en/main/guides/deployment>deployment targets</a> and I use the <a href=https://arc.codes/docs/en/get-started/quickstart>aws architect</a> template. If I use AWS to host my frontend application, then I will use <a href=https://aws.amazon.com/cloudfront/>AWS cloudfront</a> as my CDN. Cloudfront is a proxy that sits in front of your origin server (AWS API gateway in this example) and reduces the number of requests to the origin server by caching objects at the edge.<p>When configuring Cloudfront, you need to specify which cache keys Cloudfront will use to invalidate the cache. I had not configured CloudFront to include querystring parameters in the cache key.<p>Finally, we have the true nature of this bug. The first time I navigated to the route <a href=https://frontendrescue.com/posts>/posts</a>, this happened in response to me clicking a link, and this caused a client-side render. When rendering on the client, Remix only requires the loader data, so Remix made a request with the <code>?_data</code> querystring to <a href=\"https://frontendrescue.com/posts?_data=routes%2Fposts._index\">/posts?_data=routes%2Fposts._index</a>.<p>Cloudfront then cached this data, but because I had not configured Cloudfront to include querystring parameters in the cache keys, Cloudfront returned the JSON from the previous request the next time I went to this route by pasting the URL <a href=https://frontendrescue.com/posts>https://frontendrescue.com/posts</a> directly into the browser address bar.<p>The cache not getting invalidated explains why I got the loader's JSON response and why anybody else in the known universe was getting the correct HTML when I asked them to click the link.<p>It was easy to configure CloudFront when armed with the knowledge.<p><img alt=\"Configuring Cloudfront cache keys\"src=https://res.cloudinary.com/ddospxsc8/image/upload/v1692454038/cf_r77gaq.png>.<h2>Every bug is knowledge</h2><p>I want to thank the devs who helped me with this troubling bug in the <a href=https://discord.com/invite/xwx7mMzVkA>remix discord server</a>. I struggled with this one.<p>The good thing about going through this is that I know much more about Remix and more about CloudFront caching if things go wrong.",
  "frontmatter": {
    "meta": {
      "title": "remix-run route returning the loader function's JSON instead of HTML because of missing AWS Cloudfront cache keys",
      "Description": "I had a very troubling bug whereby hitting a route in a remix-run application returned the loader function's JSON and not the default export's HTML",
      "date": "2023-08-19T00:00:00.000Z",
      "image": "https://res.cloudinary.com/ddospxsc8/image/upload/v1692905654/remix2_b9upfh.png",
      "tags": ["remix", "react", "aws"]
    }
  }
}
